[
    [
        "С чего начать работу?",
        "Здравствуйте! Для начала работы с системой вам необходимо ознакомиться с документацией, которая содержит подробные инструкции по использованию программного обеспечения.\n\nДля этого перейдите на официальный сайт компании ООО «Сила» или обратитесь к разделу «Документация» в системе. Изучите разделы, посвящённые установке и настройке системы, а также управлению ресурсами и профилями. Это поможет вам понять основные принципы работы с программным обеспечением и начать его использовать."
    ],
    [
        "Какой первый шаг?",
        "Здравствуйте!\n\nПервый шаг — ознакомиться с документацией или обратиться к специалисту, чтобы понять, как начать работу с системой. \n\nВ вашем случае это может быть запуск ПО «КК» через браузер и авторизация по логину и паролю (источник 3)."
    ],
    [
        "Как провести аудит?",
        "Здравствуйте! Для проведения аудита конфигурации ПО необходимо создать область аудита — набор профилей и ресурсов, для которых запускаются задачи на аудит.\n\nДля создания области аудита на базе профилей:\n1. Нажмите кнопку «+» над списком областей и дождитесь всплытия окна создания области.\n2. Введите наименование области аудита.\n3. Отметьте пункт «Профилей».\n4. Нажмите кнопку «Далее».\n5. Отметьте профили, на основании которых требуется провести аудит, в списке профилей.\n6. Нажмите кнопку «Далее».\n7. Отметьте ресурсы, которые применимы к выбранным профилям, в списке ресурсов.\n8. Нажмите кнопку «Сохранить».\n\nУбедитесь, что область аудита появилась в списке областей.\n\nЧтобы создать область аудита на базе ресурсов:\n1. Нажмите кнопку «+» над списком областей и дождитесь всплытия окна создания области.\n2. Введите наименование области аудита.\n3. Отметьте пункт «Ресурсов».\n4. Нажмите кнопку «Далее».\n5. Отметьте ресурсы, на основании которых требуется провести аудит, в списке ресурсов.\n6. Нажмите кнопку «Далее».\n7. Отметьте профили, которые применимы к выбранным ресурсам, в списке профилей.\n8. Нажмите кнопку «Сохранить».\n\nУбедитесь, что области аудита появилась в списке областей."
    ],
    [
        "Что такое «Профиль»?",
        "Профиль — это элемент системы, который содержит требования к параметрам безопасности конфигурации компонента."
    ],
    [
        "Как создать профиль?",
        "Для создания профиля необходимо выполнить следующие шаги:\n1. Выбрать пункт «Профили» в меню на странице системы.\n2. Нажать кнопку «+ Профиль» справа над списком профилей.\n3. Ввести уникальное наименование профиля и убедиться, что в качестве источника набора требований выбран пункт «Не задан».\n4. Нажать кнопку «Сохранить»."
    ],
    [
        "Как создать требование?",
        "Требование можно создать вне или внутри раздела.\n\nДля создания требования вне раздела нажмите кнопку «+» над списком требований, а затем — кнопку в правом верхнем углу созданного требования. Заполните данные созданного требования (см. пункты 2.9.6, 2.9.7, 2.9.8, 2.9.9 и 2.9.10). Нажмите кнопку «Сохранить».\n\nЧтобы создать требование внутри раздела, нажмите правой кнопкой мыши на раздел, в котором требуется создать требование, затем нажмите кнопку «Создать требование» в контекстном меню. Нажмите кнопку в правом верхнем углу созданного требования, заполните данные и нажмите «Сохранить»."
    ],
    [
        "Что такое применимость профиля? Применимость требования? Могут ли применимости не совпадать?",
        "Применимость профиля — это свойство, которое определяет, к каким моделям программного обеспечения (ПО) может быть применён профиль.\n\nПрименимость требования — это атрибут требования, который определяет, в каких условиях или для каких моделей ПО оно должно выполняться.\n\nДа, применимости могут не совпадать, что позволяет более гибко настраивать профили и требования в соответствии с конкретными потребностями пользователей системы."
    ],
    [
        "Как создать ресурс? Где взять IP-адрес ресурса?",
        "Здравствуйте!\n\nДля создания ресурса нажмите кнопку «+» над списком ресурсов или воспользуйтесь контекстным меню раздела. Дождитесь всплытия окна создания ресурса. Введите наименование ресурса, включите работу с ресурсом по сети переключателем «Работать с ресурсом по сети», введите IP-адрес ресурса и выберите шлюз автоматизации из перечня шлюзов. Нажмите кнопку «Сохранить»."
    ],
    [
        "Зачем нужен ресурс оффлайн?",
        "Ресурс без сетевого доступа (offline-ресурс) нужен для того, чтобы обеспечить работу конфигурационной единицы в инфраструктуре без взаимодействия с сетью."
    ],
    [
        "Не создается ресурс, что делать?",
        "Здравствуйте!\n\nДля создания ресурса попробуйте выполнить следующие шаги:\n\n1. Нажмите отмеченную кнопку «+» над списком ресурсов или контекстное меню раздела.\n2. Дождитесь всплытия окна создания ресурса.\n3. Введите наименование ресурса, при необходимости включите работу с ресурсом по сети и выберите шлюз автоматизации из перечня шлюзов.\n4. Нажмите кнопку «Сохранить».\n\nЕсли после выполнения этих действий ресурс не создастся, пожалуйста, напишите в поддержку компании ООО «Сила» на почту info@lense.ru или позвоните по телефону +7 (495) 258-06-36."
    ],
    [
        "Как включить шлюз?",
        "Для активации шлюза нажмите кнопку «Активировать» в строке шлюза. Убедитесь, что состояние шлюза стало «Активирован»."
    ],
    [
        "В области аудита не виден профиль, почему?",
        "Здравствуйте!\n\nДля решения этого вопроса, пожалуйста, проверьте корректность настроек в области аудита. \n\nУбедитесь, что вы нажали отмеченную кнопку [img_data/imgs46.jpg] справа в строке с наименованием области аудита, которую требуется отредактировать. Затем нажмите кнопку «Редактировать» и отметьте профили, которые требуется добавить в область. После этого удалите отметки с профилей, которые требуется удалить из области, и сохраните изменения."
    ],
    [
        "Почему не отображается ресурс при создании области аудита?",
        "Здравствуйте!\n\nДля решения этого вопроса рекомендую проверить, отмечен ли пункт «Ресурсов» или «Профилей» в зависимости от того, на базе чего создаётся область аудита.\n\nЕсли ресурс не отображается при создании области аудита на базе ресурсов, то, возможно, проблема связана с тем, что ресурс не был отмечен в списке. В таком случае необходимо выбрать нужный ресурс и отметить его.\n\nТакже стоит убедиться, что у вас есть соответствующие права доступа для создания областей аудита. Если вы всё ещё испытываете трудности, обратитесь в службу поддержки."
    ],
    [
        "Почему в требовании во вкладке «Сбор конфигурации» не отображается созданный ресурс?",
        "Здравствуйте!\n\nДля того чтобы в требовании во вкладке «Сбор конфигурации» отобразился созданный ресурс, необходимо добавить данные автоматического сбора конфигурации. Для этого:\n1. Нажмите на вкладку «Сбор конфигурации».\n2. Выберите группу применимости из списка групп.\n3. Введите скрипт для автоматического сбора.\n4. Нажмите кнопку «Сохранить»."
    ],
    [
        "Что такое «Шаблон»?",
        "**Шаблон безопасной конфигурации** — это набор рекомендуемых требований безопасности к модели ПО. Шаблоны являются основой профилей проверок, которые создают пользователи. \n\nШаблоны предоставляются разработчиками системы в файлах в формате LNZ. После загрузки шаблона его модель появится в иерархии моделей ПО. Система содержит следующую информацию о шаблонах: наименование, номер версии, дата последнего обновления версии и применимость.\n\nС шаблонами можно осуществлять следующие действия: загружать, обновлять, создавать и выгружать. Для управления шаблонами требуется выбрать пункт «Шаблоны» в меню на странице системы."
    ],
    [
        "Выполнен аудит, почему статус протокола остался «В работе»?",
        "Здравствуйте!\n\nСтатус протокола «В работе» означает, что в протоколе есть требования, требующие ручного действия. Возможно, протокол аудита не был завершён полностью.\n\nДля завершения протокола аудита выполните необходимые ручные действия для требований с отметками «требуется завершить сбор конфигурации» или «требуется завершить анализ конфигурации».\n\nЧтобы завершить сбор конфигурации:\n1. Выберите требование с соответствующей отметкой из списка требований.\n2. Перейдите на вкладку «Сбор конфигурации».\n3. Нажмите отмеченную кнопку для указания результата сбора.\n4. Укажите результат сбора (если результатом является текст, то введите строку, которая должна быть результатом сбора).\n5. Нажмите кнопку «Сохранить».\n6. Нажмите кнопку «Завершить сбор».\n7. Убедитесь, что отметка о необходимости завершить сбор конфигурации исчезла.\n\nПосле выполнения всех необходимых действий статус протокола должен измениться на «Завершен»."
    ],
    [
        "Модели ПО для чего нужны? Кто их создает?",
        "Модели программного обеспечения (ПО) нужны для того, чтобы устанавливать применимость профилей к проверкам экземпляров ПО при проведении аудита.\n\nМодели ПО могут создаваться двумя способами:\n1. На основе шаблонов с помощью загрузки и обновления. Шаблоны — это рекомендуемые требования безопасности к модели ПО, которые предоставляются разработчиками системы в файлах формата LNZ. После загрузки шаблона его модель появится в иерархии моделей ПО.\n2. С помощью создания на основе профилей. Создание шаблона осуществляется на странице «Профили»."
    ],
    [
        "Как работать с Моделью ПО?",
        "Модель ПО можно создать двумя способами: с помощью загрузки шаблона или через кнопку на странице моделей ПО через контекстное меню раздела.\n\nДля создания модели ПО через кнопку нажмите отмеченную кнопку над списком моделей. Убедитесь, что новая модель ПО появилась в списке моделей.\n\nДля создания модели ПО через контекстное меню нажмите правой кнопкой мыши на раздел, в котором требуется создать модель ПО. Нажмите кнопку «Создать модель ПО» в контекстном меню. Убедитесь, что новая модель ПО появилась в списке моделей."
    ],
    [
        "Модели ПО и их связь с программной топологией ресурса",
        "Здравствуйте!\n\nМодели программного обеспечения (ПО) — это элементы иерархической структуры, которые определяют применимость профилей и требований к ПО. Они связаны с программной топологией ресурса через экземпляры ПО уровней 1 и 2.\n\nДля управления моделями ПО необходимо выбрать пункт «Администрирование» – «Модели ПО» в меню на странице системы. Создание модели ПО осуществляется двумя способами: с помощью загрузки шаблона или через кнопку на странице моделей ПО или через контекстное меню раздела.\n\nВозможность функционирования модели ПО уровня 2 на модели ПО уровня 1 устанавливается путём добавления связи. Для этого необходимо выбрать модель ПО, которой требуется установить связь, в списке моделей уровня 1, нажать на кнопку в строке модели ПО уровня 1 и перетащить модель ПО уровня 2 в область «Уровень 1».\n\nБолее подробную информацию о моделях ПО можно найти в разделе 2.6 текста."
    ],
    [
        "Учетные записи ПО и их связь с программной топологией ресурса",
        "Здравствуйте! Для получения информации об учётных записях ПО и их связи с программной топологией ресурса обратитесь к пункту 2.10.12, где описан процесс редактирования экземпляра ПО в программной топологии ресурса. В этом пункте можно найти информацию о том, как изменить параметры подключения экземпляров ПО, включая тип учётной записи и номер порта.\n\nК сожалению, в данном разделе не представлена информация о прямой связи учётных записей ПО с программной топологией ресурса. Однако здесь описаны действия по редактированию параметров подключения для экземпляров ПО любого уровня."
    ],
    [
        "Закончилась лицензия КК – как продлить?",
        "Здравствуйте!\n\nДля продления лицензии обратитесь к руководству администратора."
    ],
    [
        "Можно ли редактировать профиль «Активный»?",
        "Здравствуйте! Да, профиль «Активный» можно редактировать. Для этого нажмите на наименование профиля, который требуется отредактировать, в списке профилей и выполните необходимые действия."
    ],
    [
        "Можно ли редактировать профиль «Архивный»?",
        "Профиль в статусе «Архивный» нельзя отредактировать. Для изменения профиля, его необходимо активировать."
    ],
    [
        "Можно ли создать копию профиля?",
        "Да, можно создать копию профиля двумя способами: через список профилей и через карточку профиля."
    ],
    [
        "Можно ли выгрузить скрипты выполненного протокола?",
        "Здравствуйте!\n\nДля выполнения вашего запроса выберите «Протокол» в строке подзадачи, затем нажмите кнопку «Завершить сбор». После этого вы сможете скачать скрипт выполненного протокола. \n\nЕсли у вас остались вопросы — обращайтесь!"
    ],
    [
        "Сколько максимально можно создать ресурсов?",
        "Здравствуйте!\n\nВ системе нет ограничений на количество создаваемых ресурсов."
    ],
    [
        "Сколько максимально можно создать профилей?",
        "Здравствуйте!\n\nВ системе можно создать любое количество профилей."
    ],
    [
        "Сколько максимально можно создать требований в профиле?",
        "Здравствуйте!\n\nВ системе не существует ограничений на количество требований в профиле."
    ],
    [
        "Возможные ошибки при аудите?",
        "Здравствуйте!\n\nВ ходе аудита могут возникнуть различные ошибки. Например, в веб-интерфейсе может появиться уведомление «Could not validate credentials». В таком случае требуется ввести валидный логин и пароль.\n\nЕсли у вас возникли вопросы или проблемы при аудите, обратитесь в службу поддержки."
    ],
    [
        "Статусы проверок в протоколе: «соответствует», «не соответствует», «в работе», «не применимо»",
        "Из пункта 2.11.7 следует, что в протоколе аудита экземпляра ПО могут быть указаны статусы «в работе», «завершён». Также протокол может содержать информацию о результатах проверок, которые могут иметь следующие статусы: «соответствует», «не соответствует», «ошибка ресурса», «не применимо».\n\nДля просмотра протокола аудита необходимо убедиться, что подзадача, протокол которой требуется посмотреть, имеет статус «завершена»."
    ],
    [
        "Создано 2 блока применимости требования, выбираю требование, в нем не отображаются заполненные поля скрипта, почему?",
        "Здравствуйте!\n\nСпасибо за ваш вопрос. Для корректной работы системы необходимо, чтобы все её элементы функционировали правильно. \n\nЕсли у вас возникли проблемы с отображением заполненных полей скрипта в карточке требования, рекомендую проверить корректность настроек и правильность ввода данных. Если самостоятельно разобраться не получается, обратитесь в службу поддержки.\n\nКонтакты службы поддержки: +7 (495) 258-06-36, info@lense.ru, lense.ru."
    ],
    [
        "Не могу удалить профиль, почему?",
        "Здравствуйте!\n\nПрофиль нельзя удалить, если в нём содержатся требования. Для удаления профиля необходимо активировать его, убедиться, что статус профиля «Черновик» и только после этого удалять профиль. \n\nЕсли у вас возникли трудности с активацией профиля или удалением требований из профиля, пожалуйста, предоставьте более подробную информацию, чтобы я мог помочь вам разобраться в ситуации."
    ],
    [
        "Можно ли создать свой шаблон и выгрузить его?",
        "Здравствуйте!\n\nДа, можно создать свой шаблон и выгрузить его. Для создания шаблона необходимо нажать на профиль, на основе которого требуется создать шаблон, в списке профилей, а затем нажать отмеченную кнопку в строке с названием профиля и дождаться появления окна создания шаблона. \n\nДля выгрузки шаблона требуется нажать на профиль, шаблон которого требуется выгрузить, в списке профилей и нажать отмеченную кнопку в строке с названием профиля."
    ],
    [
        "Где ознакомиться с документацией на КК?",
        "С документацией на систему управления безопасностью конфигураций ПО можно ознакомиться на странице «О продукте»."
    ],
    [
        "Откуда берется балл протокола? Как считается?",
        "Балл протокола аудита определяется на основе результатов проверок, выполненных в рамках аудита. Он может зависеть от количества и сложности проверок, а также от того, насколько успешно они были пройдены.\n\nВ тексте нет информации о том, как именно считается балл протокола, но указано, что он отражает общую оценку по результатам аудита."
    ],
    [
        "Типы ошибок в КК",
        "В системе управления безопасностью конфигураций ПО КК могут возникать различные ошибки, связанные с функционированием системы. Для получения более подробной информации об ошибках и способах их устранения рекомендуется обратиться к руководству администратора или в службу поддержки."
    ],
    [
        "Авторизация: не получается авторизоваться, что делать? Пароль не подходит",
        "Здравствуйте! \n\nДля авторизации в ПО «КК» необходимо ввести логин и пароль в соответствующие поля. Если вход в платформу был выполнен успешно, откроется главная страница. В целях безопасности в ПО предусмотрена смена пароля при истечении его срока действия.\n\nЕсли у вас не получается авторизоваться, пожалуйста, попробуйте проверить правильность введённых данных. Также вы можете обратиться в службу поддержки по телефону +7 (495) 258-06-36, написать письмо на info@lense.ru или воспользоваться формой регистрации заявки на сайте lense.ru."
    ]
]