[
    [
        "С чего начать работу?",
        "Здравствуйте!\n\nДля начала работы с системой рекомендуется ознакомиться с документацией, чтобы лучше понять основные принципы и функции. Затем вы можете приступить к созданию профилей, ресурсов или настройке других параметров в соответствии с инструкциями и рекомендациями. Если у вас возникнут вопросы или проблемы, не стесняйтесь обращаться за помощью к специалистам."
    ],
    [
        "Какой первый шаг?",
        "Здравствуйте! Для начала работы с системой необходимо перейти на её страницу."
    ],
    [
        "Как провести аудит?",
        "Здравствуйте! Для проведения аудита требуется создать область аудита — набор профилей и ресурсов, для которых запускаются задачи на аудит.\n\nОбласть аудита содержит следующую информацию:\n* наименование;\n* дату и время последнего редактирования;\n* дату и время последнего запуска;\n* список задач.\n\nЗадачи на аудит состоят из подзадач — наборов проверок экземпляров ПО на соответствие требованиям в заданных профилях. Проверка выполняется для конкретного требования и состоит из следующих шагов: сбор конфигурации (процедура получения конфигурационных параметров для конкретного экземпляра ПО) и анализ конфигурации (процедура оценки конфигурации на основе её собранных параметров). В результате завершения подзадачи формируется протокол, в результате завершения задачи — отчёт.\n\nДля проведения аудита и управления связанными с ним сущностями требуется выбрать пункт «Аудиты» в меню на странице системы. Создание области аудита осуществляется на странице «Аудиты»."
    ],
    [
        "Что такое «Профиль»?",
        "Профиль — это элемент системы, который содержит информацию о требованиях к параметрам безопасности конфигурации компонента."
    ],
    [
        "Как создать профиль?",
        "Здравствуйте!\n\nЧтобы создать профиль, нажмите кнопку «+ Профиль» справа над списком профилей. Дождитесь всплытия окна создания профиля. Введите уникальное наименование профиля и убедитесь, что в качестве источника набора требований выбран пункт «Не задан». Нажмите кнопку «Сохранить»."
    ],
    [
        "Как создать требование?",
        "Здравствуйте! \n\nТребование можно создать вне или внутри раздела. Для создания требования вне раздела нажмите кнопку «+» над списком требований, а затем — кнопку в правом верхнем углу созданного требования. Заполните данные созданного требования и нажмите «Сохранить».\n\nДля создания требования внутри раздела, нажмите правой кнопкой мыши на раздел, в котором требуется создать требование, а затем кнопку «Создать требование» в контекстном меню. Нажмите кнопку в правом верхнем углу созданного требования, заполните данные и нажмите «Сохранить»."
    ],
    [
        "Что такое применимость профиля? Применимость требования? Могут ли применимости не совпадать?",
        "**Применимость профиля** — это свойство, которое определяет, к каким моделям программного обеспечения (ПО) может быть применён профиль.\n\n**Применимость требования** — это атрибут, который указывает, к какой группе моделей ПО относится конкретное требование. \n\nДа, применимости могут не совпадать. Это означает, что один и тот же профиль может применяться к разным моделям ПО, а одно и то же требование может относиться к разным группам моделей ПО."
    ],
    [
        "Как создать ресурс? Где взять IP-адрес ресурса?",
        "Для создания ресурса нажмите кнопку «Создать ресурс» в контекстном меню. Дождитесь всплытия окна создания ресурса. Введите наименование ресурса. Включите работу с ресурсом по сети переключателем «Работать с ресурсом по сети». Введите IP-адрес ресурса. Выберите шлюз автоматизации из перечня шлюзов. Нажмите кнопку «Сохранить»."
    ],
    [
        "Зачем нужен ресурс оффлайн?",
        "Ресурс, работающий в офлайн-режиме, может быть полезен в ситуациях, когда требуется обеспечить непрерывную работу без подключения к сети. Это особенно актуально для систем, требующих высокой надёжности и доступности данных, даже при отсутствии или нестабильности сетевого соединения."
    ],
    [
        "Не создается ресурс, что делать?",
        "Здравствуйте!\n\nДля создания ресурса нажмите кнопку «Создать ресурс» в контекстном меню. Дождитесь всплытия окна создания ресурса. Введите наименование ресурса. Включите работу с ресурсом по сети переключателем «Работать с ресурсом по сети». Введите IP-адрес ресурса. Выберите шлюз автоматизации из перечня шлюзов. Нажмите кнопку «Сохранить».\n\nЕсли проблема не устранится, обратитесь к администратору системы."
    ],
    [
        "Как включить шлюз?",
        "Для активации шлюза нажмите кнопку «Активировать» в строке шлюза. Убедитесь, что состояние шлюза стало «Активирован». При деактивации шлюза обслуживание его ресурсов будет прекращено."
    ],
    [
        "В области аудита не виден профиль, почему?",
        "Здравствуйте!\n\nДля решения этой проблемы, пожалуйста, проверьте следующие шаги:\n1. Убедитесь, что подзадача, протокол которой требуется просмотреть, имеет статус «Завершена».\n2. Нажмите кнопку «Протокол» в строке подзадачи, протокол которой требуется посмотреть.\n\nЕсли после выполнения этих действий профиль по-прежнему не отображается, обратитесь к специалистам компании для получения дополнительной помощи."
    ],
    [
        "Почему не отображается ресурс при создании области аудита?",
        "Здравствуйте!\n\nЧтобы создать область аудита, необходимо нажать правой кнопкой мыши на ресурс, который требуется удалить, в списке ресурсов раздела. Возможно, проблема с отображением ресурса связана с техническими неполадками или ошибкой пользователя. Для устранения проблемы рекомендуется обратиться к специалистам технической поддержки компании ООО «Сила»."
    ],
    [
        "Почему в требовании во вкладке «Сбор конфигурации» не отображается созданный ресурс?",
        "Здравствуйте! Для того чтобы в требовании во вкладке «Сбор конфигурации» отобразился созданный ресурс, необходимо добавить этот ресурс в систему.\n\nДля этого:\n1. Перейдите в раздел «Ресурсы».\n2. Нажмите на кнопку «+» над списком ресурсов.\n3. Введите наименование ресурса.\n4. Включите работу с ресурсом по сети переключателем «Работать с ресурсом по сети».\n5. Введите IP-адрес ресурса.\n6. Выберите шлюз автоматизации из перечня шлюзов.\n7. Нажмите кнопку «Сохранить».\n\nПосле этого созданный ресурс отобразится в списке ресурсов и его можно будет использовать при создании требований."
    ],
    [
        "Что такое «Шаблон»?",
        "Шаблон — это набор рекомендуемых требований безопасности к модели ПО. Эти шаблоны являются основой профилей проверок, которые создают пользователи. Они предоставляются разработчиками системы в файлах в формате LNZ. После загрузки шаблона его модель появится в иерархии моделей ПО."
    ],
    [
        "Выполнен аудит, почему статус протокола остался «В работе»?",
        "Здравствуйте! \n\nСтатус протокола аудита «В работе» означает, что в протоколе есть требования, требующие ручного действия. Возможно, протокол не был завершён или не все проверки были завершены. \n\nДля получения более подробной информации рекомендуется обратиться к специалистам компании ООО «Сила»."
    ],
    [
        "Модели ПО для чего нужны? Кто их создает?",
        "Модели ПО нужны для назначения применимости профилям и требованиям. Их создаёт пользователь с помощью загрузки шаблона или через контекстное меню раздела."
    ],
    [
        "Как работать с Моделью ПО?",
        "Модель ПО можно создать двумя способами: с помощью загрузки шаблона или через кнопку на странице моделей ПО. Для создания модели ПО через кнопку нажмите отмеченную кнопку над списком моделей. Убедитесь, что новая модель ПО появилась в списке моделей.\n\nТакже модель ПО можно создать через контекстное меню раздела. Нажмите правой кнопкой мыши на раздел, в котором требуется создать модель ПО, и выберите «Создать модель ПО». Убедитесь, что модель ПО появилась в списке."
    ],
    [
        "Модели ПО и их связь с программной топологией ресурса",
        "В программной топологии ресурса содержатся экземпляры ПО уровней 1 и 2 в соответствии с иерархией моделей ПО. Программная топология формируется на основе добавленного экземпляра ПО уровня 1, который задаёт список экземпляров ПО уровня 2.\n\nДобавление экземпляров ПО осуществляется в карточке ресурса на странице «Ресурсы». Для добавления экземпляров ПО в программную топологию необходимо выбрать ресурс в списке ресурсов, нажать отмеченную кнопку и дождаться появления окна редактирования программной топологии. После этого можно добавить экземпляр ПО уровня 1 или уровня 2, а также отредактировать параметры подключения для каждого из них."
    ],
    [
        "Учетные записи ПО и их связь с программной топологией ресурса",
        "Для каждого экземпляра ПО в системе указано наименование. Если ресурс работает по сети, то у экземпляров также указаны тип взаимодействия, номер порта, тип и данные учётной записи."
    ],
    [
        "Закончилась лицензия КК – как продлить?",
        "Здравствуйте!\n\nПродление лицензии системы управления безопасностью конфигураций ПО «КК» не рассматривается в доступных мне материалах. Если у вас возникла проблема с лицензией, рекомендую обратиться к документации или поддержке компании ООО «Сила»."
    ],
    [
        "Можно ли редактировать профиль «Активный»?",
        "Здравствуйте! Да, профиль «Активный» можно редактировать."
    ],
    [
        "Можно ли редактировать профиль «Архивный»?",
        "Здравствуйте! \n\nПрофиль, который имеет статус «Архивный», редактировать нельзя."
    ],
    [
        "Можно ли создать копию профиля?",
        "Да, можно создать копию профиля двумя способами: через список профилей или через карточку профиля."
    ],
    [
        "Можно ли выгрузить скрипты выполненного протокола?",
        "Здравствуйте! Для этого необходимо завершить протокол аудита. \n\nЗавершение протокола подразумевает выполнение необходимых ручных действий для требований с отметками «требуется завершить сбор конфигурации» или «требуется завершить анализ конфигурации».\n\nЧтобы завершить протокол, выберите требование с соответствующей отметкой из списка требований. Перейдите на вкладку «Сбор конфигурации» («Анализ конфигурации»). Нажмите отмеченную кнопку для указания результата сбора (анализа). Выберите результат сбора (анализа) и нажмите кнопки «Сохранить» и «Завершить сбор» («Завершить анализ»). Убедитесь, что отметка о необходимости завершить сбор (анализ) конфигурации исчезла у требования."
    ],
    [
        "Сколько максимально можно создать ресурсов?",
        "Здравствуйте!\n\nВ системе нет ограничений на количество создаваемых ресурсов."
    ],
    [
        "Сколько максимально можно создать профилей?",
        "Здравствуйте! К сожалению, в текстах не содержится информация о максимальном количестве профилей."
    ],
    [
        "Сколько максимально можно создать требований в профиле?",
        "Здравствуйте!\n\nВ системе не существует ограничения на максимальное количество требований в профиле."
    ],
    [
        "Возможные ошибки при аудите?",
        "Здравствуйте!\n\nВ рамках обсуждаемых тем могу сообщить, что в ходе аудита могут возникнуть ошибки. Например, веб-интерфейс может отобразить уведомления «Could not validate credentials», «Ошибка обновления шаблона» или «Выбранный элемент уже используется в данном требовании». \n\nДля получения более подробной информации о возможных ошибках при аудите рекомендую обратиться к таблице «Сообщения об ошибках» в Источнике 3."
    ],
    [
        "Статусы проверок в протоколе: «соответствует», «не соответствует», «в работе», «не применимо»",
        "Здравствуйте!\n\nСтатусы проверок в протоколе аудита конфигураций программного обеспечения означают следующее:\n* «соответствует» — все проверки завершены успешно;\n* «не соответствует» — требования не выполнены;\n* «в работе» — есть требования, требующие ручного действия;\n* «не применимо» — требование неприменимо к данному профилю или экземпляру ПО."
    ],
    [
        "Создано 2 блока применимости требования, выбираю требование, в нем не отображаются заполненные поля скрипта, почему?",
        "Здравствуйте!\n\nДля решения этой проблемы, пожалуйста, проверьте корректность заполнения полей скрипта в соответствии с инструкциями. Возможно, потребуется обновить или перезагрузить страницу для отображения изменений. Если проблема не решится, рекомендуется обратиться к специалистам компании ООО «Сила» за дополнительной помощью."
    ],
    [
        "Не могу удалить профиль, почему?",
        "Здравствуйте! Для удаления профиля требуется, чтобы его статус был «Черновик». Проверьте статус профиля и попробуйте удалить его снова."
    ],
    [
        "Можно ли создать свой шаблон и выгрузить его?",
        "Да, можно создать свой шаблон и выгрузить его. Для создания шаблона нажмите на профиль, на основе которого требуется создать шаблон, в списке профилей. Нажмите отмеченную кнопку в строке с названием профиля и дождитесь появления окна создания шаблона. Введите наименование шаблона, нажмите «Сохранить». Перейдите на страницу «Шаблоны» и убедитесь, что шаблон появился в списке шаблонов. Выгрузка шаблонов необходима для распространения шаблонов пользователям. Шаблоны выгружаются в формате LNZ. Выгрузка доступна только для профилей, на основе которых созданы шаблоны."
    ],
    [
        "Где ознакомиться с документацией на КК?",
        "Здравствуйте!\n\nСодержащаяся в системе информация о документации доступна на странице «О продукте»."
    ],
    [
        "Откуда берется балл протокола? Как считается?",
        "Здравствуйте! Балл протокола аудита рассчитывается на основе результатов проверки требований. Для каждого требования может быть присвоен определённый балл в зависимости от статуса проверки: «соответствует», «не соответствует», «ошибка» или «сбор конфигурации/анализ конфигурации». Балл протокола формируется на основании баллов по каждому требованию."
    ],
    [
        "Типы ошибок в КК",
        "Здравствуйте!\nВ системе управления безопасностью конфигураций ПО (КК) могут возникать различные ошибки, связанные с функционированием системы. Для получения более точной информации об ошибках в КК рекомендуется обратиться к Руководству администратора или другим специалистам, знакомым с данной системой."
    ],
    [
        "Авторизация: не получается авторизоваться, что делать? Пароль не подходит",
        "Здравствуйте!\n\nЕсли у вас возникли проблемы с авторизацией, пожалуйста, проверьте правильность введённых логина и пароля. Если вы не уверены в правильности пароля, вы можете воспользоваться функцией сброса пароля.\n\nДля этого необходимо нажать на кнопку «Забыли пароль?» и следовать инструкциям на экране.\n\nТакже, если вам требуется квалифицированная помощь, позвоните на телефон «горячей линии поддержки», напишите письмо или воспользуйтесь формой регистрации заявки на сайте."
    ]
]